{
    "header.about": "à propos",
    "header.projects": "projets",
    "header.skills": "compétences",
    "header.experience": "expérience",
    "header.contact": "contact",
    "header.resume": "CV",
    
    "hero.title.1": "hello, je suis ",
    "hero.title.2": "Damien Gervy ",
    "hero.subtext": "<1>Développeur frontend</1>, j'accorde une attention particulière à l'<3>expérience utilisateur</3> et aux <5>détails</5>",
    "hero.cta.1": "À propos de moi",
    "hero.cta.2": "Voir mes projets",

    "about.title.1": "à ",
    "about.title.2": "propos",
    "whoami.title": "qui suis-je ?",
    "whoami.description": "Je m'appelle Damien Gervy et je suis un développeur <1>frontend</1> spécialisé sur <3>React</3>. Je cherche actuellement un poste en <1>front ou en fullstack</1> pour contribuer sur des projets concrets et <1>créer de la valeur</1> avec mes développements. Mon travail est principalement axé sur la <7>qualité</7> et la <9>performance</9>.",
    "education.title": "ma formation",
    "education.description.1": "J'ai fait mes études et obtenu mon diplôme à l'",
    "education.description.2": "Université de Technologie de Troyes",
    "education.description.3": ", en 2021. Mon parcours à l'UTT m'a permis d'être confronté à mes premiers gros projets logiciels, et d'apprendre des outils fondamentaux comme <5>l'algorithmie</5>, les <7>statistiques</7> et la <9>géométrie</9>. Je me suis ensuite formé sur des technos spécifiques au cours de mes stages, de mes projets perso et de formations en ligne.",
    "hobbies.title": "mon objectif",
    "hobbies.description": "Au travers du code, je cherche à <1>avoir un impact réel</1> sur les projets sur lesquels je travaille, pour répondre au mieux aux besoins auxquels fait face mon client. Que ce soit en affinant la <1>définition du besoin</1>, en aiguillant les <1>choix techniques</1>, ou en m'assurant de la <1>qualité et de la fiabilité</1> du code livré, tous mes développements sont menés dans le but de satisfaire l'utilisateur final, et de lui offrir la <1>meilleure expérience possible</1>.",

    "projects.title.1": "mes ",
    "projects.title.2": "projets",
    "projects.emptysection": "... et plein d'autres sur le feu !",
    "project.mouvise.description": "Mouvise est un outil de recherche de films et de séries, alla IMDB. C'est une application en cours de construction qui s'attaque à des problématiques de présentation des données, d'intégration d'API, de routage et d'UX/UI.",
    "project.suivi.description": "Un outil que j'ai créé pour m'aider à organiser et suivre mes candidatures dans le cadre de ma recherche d'emploi (oui, vous êtes dedans). C'est un projet fullstack développé avec Django, avec une base en SQLite et du SSR.",
    "project.spotify.description": "Une application assez basique que j'ai développée pour me familiariser avec Angular, et pour réapprendre le workflow pour consommer une API en JavaScript. L'application est composée d'un unique bouton qui va récupérer et afficher une musique au hasard via l'API Spotify. Pratique en cas de panne d'inspiration.",
    "project.mods.description": "Ma passion pour les jeux m'a guidé vers le gamedev, et plus précisément vers le modding. La structure existante des jeux et de leurs systèmes permet des cycles de développement rapides et ciblés, et le déploiement est généralement facile, ce qui permet d'avoir des retours réguliers de la part des joueurs. J'en ai surtout codé pour Brotato et Slay the Spire, mais j'ai aussi touché à de la 3D sur blender.",
    "project.modLoader.description": "Un mod loader pour les jeux créés sur Godot. C'est un projet open-source sur lequel j'ai contribué, et qui a déjà été intégré officiellement sur plusieurs jeux. Le code est complètement rédigé en gdscript, le langage de script de Godot, et offre une API pour les développeurs de mods.",

    "skills.title.1": "mes ",
    "skills.title.2": "compétences",
    "skills.html.description": "\"<h1>Hello World!</h1>\"",
    "skills.css.description": "Mon plaisir coupable. J'adore les choses qu'il permet de faire, et la gymnastique mentale qu'il pousse à adopter pour y arriver.",
    "skills.tailwind.description": "CSS sans les lourdeurs de CSS, un vrai plaisir.",
    "skills.sass.description": "Je l'ai surtout utilisé pour les variables et le nesting.",
    "skills.typescript.description": "J'ai appris TypeScript pendant un stage où j'ai migré un outil interne depuis JavaScript. Je l'utilise maintenant religieusement.",
    "skills.reactjs.description": "Ce site est développé sur React !",
    "skills.nodejs.description": "Vous reprendrez bien quelque API REST ?",
    "skills.java.description": "J'ai développé en Java pour des projets professionnels, personnels et scolaires.",
    "skills.docker.description": "J'adore naviguer !",
    "skills.python.description": "Un langage que j'ai surtout utilisé pour gérer des fichiers quand je moddais.",
    "skills.django.description": "J'ai appris Django pour un projet personnel que vous pouvez retrouver plus haut.",
    "skills.git.description": "Je maîtrise les bases : branch, checkout, clone, push, pull, commit, et bien sûr, merge.",
    "skills.github.description": "Mon GitHub est dispo en bas de la page. :)",
    "skills.english.name": "Anglais",
    "skills.english.description": "\"Be you, be proud of you because, you can be, do, what we want to do.\"",
    "skills.problemsolving.name": "Résolution de problèmes",
    "skills.problemsolving.description": "Trouver des solutions efficaces à des problèmes techniques ou métier.",
    "skills.adaptability.name": "Adaptabilité",
    "skills.adaptability.description": "Actually a shapeshifter.",
    "skills.curiosity.name": "Curiosité",
    "skills.curiosity.description": "I wonder.",

    "experiences.title.1": "mon ",
    "experiences.title.2": "expérience",
    "experience.younivibe.title": "Développeur frontend chez Younivibe",
    "experience.younivibe.description": "J'ai créé une page d'accueil pour une startup à un stade précoce, en collaborant avec des designers pour donner au site l'identité visuelle du projet et pour créer une expérience utilisateur ciblée. La solution est codée en React et Tailwind, et est déployée automatiquement via Vercel.",
    "experience.younivibe.date.1": "Juil 2025",
    "experience.younivibe.date.2": "Aou 2025",
    "experience.coreoz.title": "Ingénieur fullstack (stage) chez Coreoz",
    "experience.coreoz.description": "Je suis intervenu sur plusieurs projets : des applications et des outils internes, et des applications métier. La stack technique était du React côté front, et côté back du Java/Spring Boot avec une base en Postgre. J'ai énormément progressé sur React grâce à ces différents projets. J'ai aussi étroitement collaboré avec l'UX/UI designer sur un projet de refonte d'application métier, ce qui m'a permis d'implémenter des maquettes de zéro, et de mieux comprendre les problématiques liées à l'expérience utilisateur.",
    "experience.coreoz.date.1": "Nov 2020",
    "experience.coreoz.date.2": "Avr 2021",
    "experience.factorythings.title": "Ingénieur backend (stage) chez factorythings",
    "experience.factorythings.description": "J'ai travaillé sur la solution principale de la boîte : une application web B2B de visualisation de données industrielles provenant de capteurs connectés IoT. J'ai implémenté les protocoles de communication sur le backend en Node.js et j'ai collaboré avec le Lead pour adapter l'architecture. J'ai aussi corrigé des bugs et fait des retouches visuelles sur l'interface utilisateur en React.",
    "experience.factorythings.date.1": "Aou 2018",
    "experience.factorythings.date.2": "Jan 2019",

    "contact.title.1": "contactez ",
    "contact.title.2": "moi!"


}