{
    "header.about": "about me",
    "header.projects": "projects",
    "header.skills": "skills",
    "header.experience": "experience",
    "header.contact": "contact",
    "header.resume": "Resume",
    
    "hero.title.1": "Hey, ",
    "hero.title.2": "I'm Damien ",
    "hero.subtext": "I'm a <1>fullstack developer</1> who is passionate about <3>user experience</3> and attentive to <5>detail</5>.",
    "hero.cta.1": "More about me",
    "hero.cta.2": "Check my projects",

    "about.title.1": "about ",
    "about.title.2": "me",
    "whoami.title": "who am I ?",
    "whoami.description": "I am Damien Gervy, a fullstack developer specialized in React, Typescript, and I am currently looking for opportunities to work in a team and contribute to real projects.",
    "education.title": "my education",
    "education.description.1": " I attended and graduated from the ",
    "education.description.2": "University of Technology of Troyes",
    "education.description.3": " in 2021, where I had my first experiences working on coding projects in teams through internships and school projects.",
    "hobbies.title": "my skillset",
    "hobbies.description": "Through my experiences, I was able to deliver meaningful projects such as SaaS applications, developer tools and games, all of which are still being used today. I'm open-minded and can handle both business logic and user interface implementations.",

    "projects.title.1": "my ",
    "projects.title.2": "projects",
    "projects.emptysection": "... and more to come !",
    "project.mouvise.description": "Mouvise is a fast and lightweight IMDB-like app I'm currently building. It tackles things like handling data, API calls, routing, and interface design.",
    "project.suivi.description": "Suivi Candidatures - French for 'application tracking' - is a tool I developed to help me keep track of all the applications I've sent (you're in there). It is a fullstack project with a few pages, data management and server side rendering.",
    "project.spotify.description": "A simple app I made to familiarize myself with Angular. This app shows you a random track with the press of a button. It uses the Spotify API.",
    "project.mods.description": "My love for games has led me to explore game dev, and I started modding as a way to gain experience developing and testing in short cycles. Mods have the advantage of requiring a minimal setup to work, and having a bunch of game system ready to be messed with. I made mods mostly for Brotato and Slay the Spire, but I have also tried my hand at 3D animation with blender.",
    "project.modLoader.description": "A mod loader for games made in Godot. This is an open source project I contributed on, and it has been officially added to several games already. It is fully written in Godot's scripting language, gdscript, and also acts as an API to mod developers.",

    "skills.title.1": "my ",
    "skills.title.2": "skills",
    "skills.html.description": "\"<h1>Hello World!</h1>\"",
    "skills.css.description": "My guilty pleasure, I love animating stuff on screen and centering divs.",
    "skills.tailwind.description": "Basically CSS with a much smoother workflow, it's awesome.",
    "skills.sass.description": "I've mostly used the nesting and variables.",
    "skills.typescript.description": "I have learned TypeScript back during an internship, where I migrated an internal application from JavaScript. I use it in every project now.",
    "skills.reactjs.description": "This website was made in it !",
    "skills.nodejs.description": "",
    "skills.java.description": "The language I have the most  experience in, through web dev with Spring Boot, and game dev as a hobby.",
    "skills.springboot.description": "My main tool when it comes to building robust backend apps.",
    "skills.docker.description": "I love sailing.",
    "skills.python.description": "I've used Python mainly for file manipulation during my modding era.",
    "skills.django.description": "I learned Django for a personal project you can read about on this page.",
    "skills.git.description": "I know the working basics, things like branch, checkout, clone, push, pull, commit and of course merge.",
    "skills.github.description": "Feel free to check mine :)",
    "skills.english.name": "English",
    "skills.english.description": "\"Be you, be proud of you because, you can be, do, what we want to do.\"",
    "skills.problemsolving.name": "Problem solving",
    "skills.adaptability.name": "Adaptability",
    "skills.curiosity.name": "Curiosity",

    "experiences.title.1": "my ",
    "experiences.title.2": "experience",
    "experience.younivibe.title": "Frontend developer at Younivibe",
    "experience.younivibe.description": "I made the landing page for a very young startup company, collaborated with the designers to integrate the company's visual identity into the site and to deliver a smooth user experience. The whole website is written with React and Tailwind, and is deployed with Vercel.",
    "experience.younivibe.date.1": "Jul 2025",
    "experience.younivibe.date.2": "Aug 2025",
    "experience.coreoz.title": "Fullstack engineer intern at Coreoz",
    "experience.coreoz.description": "I collaborated on multiple projects : internal tools, apps and business applications. Most projects would use Spring Boot and React, and I gained a lot of hands-on experience using React in very different codebases. I also learned a lot on styling during a redesign project where I closely collaborated with the UX/UI Designer.",
    "experience.coreoz.date.1": "Nov 2020",
    "experience.coreoz.date.2": "Apr 2021",
    "experience.factorythings.title": "Backend engineer intern at factorythings",
    "experience.factorythings.description": "I worked on the company's main project : a B2B web application for visualizing data from IoT devices that monitor critical physical values on industry machines. I implemented communication protocols with Node.js and collaborated with the Product Manager to adapt the architecture. I also did some bugfixing on the UI part of the application, which introduced me to React.",
    "experience.factorythings.date.1": "Aug 2018",
    "experience.factorythings.date.2": "Jan 2019",

    "contact.title.1": "contact ",
    "contact.title.2": "me!"

}